{
  "backend/main.mo": "Main canister logic defining products, categories, carts, orders, user profiles, and admin‑protected marketplace operations with access control.",
  "backend/migration.mo": "Migration module converting old marketplace/order structures to the new schema adding accepted/declined statuses.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and shared UI tokens.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theme provider and toaster.",
  "frontend/src/components/admin/AdminProductManagementHelp.tsx": "UI help card explaining how admins can add products and required fields.",
  "frontend/src/components/auth/AuthControls.tsx": "Provides login/logout UI and a user dropdown with profile and admin options based on authentication state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter and save their display name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and displays a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/cart/MobileCartShortcut.tsx": "Displays a floating mobile-only cart button showing item count and navigating to the cart.",
  "frontend/src/components/checkout/DemoPaymentDisclaimer.tsx": "Renders a card explaining that the payment process is a demo with no real transactions.",
  "frontend/src/components/checkout/DemoPaymentMethodPanel.tsx": "Shows input panels for COD, UPI, or card payments and validates input per method.",
  "frontend/src/components/checkout/demoPaymentProcessing.ts": "Simulates asynchronous demo payment processing via a timed promise.",
  "frontend/src/components/checkout/demoPaymentReference.ts": "Generates, stores, retrieves, and clears demo transaction IDs using session storage.",
  "frontend/src/components/checkout/DemoPaymentSection.tsx": "Provides payment method selection and displays the corresponding validation panel.",
  "frontend/src/components/checkout/demoPaymentValidation.ts": "Contains validation helpers for UPI, card number, expiry, CVV, and cardholder name.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, routed content, profile setup, and mobile cart UI.",
  "frontend/src/components/layout/Footer.tsx": "Displays the footer with dynamic year and a Caffeine.ai attribution link.",
  "frontend/src/components/layout/HeaderBar.tsx": "Renders the top navigation bar with logo, links, cart badge, and authentication controls.",
  "frontend/src/components/marketplace/CategoryMenu.tsx": "Fetches and displays product categories with loading and error states, allowing users to select a category.",
  "frontend/src/components/marketplace/ProductCard.tsx": "Renders a clickable product card with image, title, category badge, and price, navigating to the product page.",
  "frontend/src/components/marketplace/ProductGrid.tsx": "Displays a responsive grid of ProductCards with skeletons, error handling, and empty-state messaging.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCart.ts": "Provides cart data by combining cart items with products and exposes mutations for adding, updating, and removing items.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile and determines admin status using the backend actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, and identity loading via AuthClient within a React context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating products, categories, orders, and related admin actions.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminSellerPage.tsx": "Admin-only page for managing products, bootstrap admin creation, and viewing order tabs with edit/add dialogs.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart with quantity updates, removal, subtotal, and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout flow handling address entry, review, simulated payments, and placing orders.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details and optional transaction reference after checkout.",
  "frontend/src/pages/OrdersPage.tsx": "Lists the authenticated user's past orders with status badges and totals.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows product details, description, pricing, and allows adding a chosen quantity to the cart.",
  "frontend/src/pages/ProfilePage.tsx": "React profile page allowing users to view principal ID, edit name, and save profile with loading and copy-to-clipboard states.",
  "frontend/src/pages/StorefrontPage.tsx": "Storefront page displaying products with category filtering, search, and an initialization hook for marketplace setup.",
  "frontend/src/utils/currency.ts": "Utility for formatting numbers as INR currency with zero decimal places.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings with plugins.",
  "project_state.json": "Project state metadata describing architecture, issues, and existing feature versions for a Meesho-like marketplace."
}