{
  "backend/main.mo": "Main backend canister defining user profiles, products with stock, categories, carts, orders, authorization checks, and marketplace CRUD operations.",
  "backend/migration.mo": "Migration logic that upgrades old marketplace data by adding a default stock field to products.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to involved frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries for various frontend source files across components, pages, and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining global OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router routes and wrapping with ThemeProvider and Toaster.",
  "frontend/src/components/admin/AdminProductManagementHelp.tsx": "Help panel explaining how admins can add products and required form fields.",
  "frontend/src/components/admin/AdminStockManagementSection.tsx": "Admin UI section for viewing and updating product stock with validation and async mutations.",
  "frontend/src/components/auth/AuthControls.tsx": "UI control for login/logout, user menu, and navigation to profile or admin pages based on auth state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their display name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that blocks access and shows a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/cart/MobileCartShortcut.tsx": "Floating mobile-only cart button showing item count and linking to the cart page.",
  "frontend/src/components/checkout/DemoPaymentDisclaimer.tsx": "Card displaying a notice that checkout uses demo-only payment processing.",
  "frontend/src/components/checkout/DemoPaymentMethodPanel.tsx": "Renders validation-driven input panels for COD, UPI, or card demo payment methods.",
  "frontend/src/components/checkout/demoPaymentProcessing.ts": "Simulates async payment processing by waiting for a specified duration.",
  "frontend/src/components/checkout/demoPaymentReference.ts": "Generates, stores, retrieves, and clears demo transaction IDs using sessionStorage.",
  "frontend/src/components/checkout/DemoPaymentSection.tsx": "Payment method selector with demo panels and disclaimer, reporting validation status upward.",
  "frontend/src/components/checkout/demoPaymentValidation.ts": "Validation helpers for UPI, card number, expiry, CVV, and cardholder name.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout containing header, footer, routed content, profile setup dialog, and mobile cart shortcut.",
  "frontend/src/components/layout/Footer.tsx": "Footer with copyright text and link attribution including dynamic app identifier.",
  "frontend/src/components/layout/HeaderBar.tsx": "Header with logo, navigation links, cart icon, and authentication controls.",
  "frontend/src/components/marketplace/CategoryMenu.tsx": "Renders a horizontal category selector that fetches categories and allows choosing a filter.",
  "frontend/src/components/marketplace/ProductCard.tsx": "Displays a product thumbnail card with image, price, and category, navigating to the product page on click.",
  "frontend/src/components/marketplace/ProductGrid.tsx": "Shows a responsive grid of ProductCards with loading, error, and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCart.ts": "Provides cart data by combining cart items with product details and exposes mutations to modify the cart.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile and checks admin status based on the authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication, storing identity state and exposing login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines product, category, and order query/mutation hooks that call backend actor methods and manage cache invalidation.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminSellerPage.tsx": "Admin page that checks admin status, supports bootstrapping the first admin, and provides UI for adding, editing, and managing products.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, stock checks, and checkout navigation with authentication handling.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi‑step checkout flow handling address entry, order review, demo payment validation, and final order submission.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details, including order ID and optional demo transaction reference, with navigation options.",
  "frontend/src/pages/OrdersPage.tsx": "Authenticated page listing a user’s past orders with status badges, loading states, and empty‑state handling.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays product details with stock‑aware quantity controls and add‑to‑cart logic requiring authentication.",
  "frontend/src/pages/ProfilePage.tsx": "React profile page that displays the user's principal ID and profile name with edit, copy, and save capabilities. Uses hooks for user data, mutation saving, and handles loading and form state.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page showing hero content, search, category filter, and a product grid. Fetches products by category and applies local search filtering.",
  "frontend/src/utils/currency.ts": "Provides a helper to format numbers as INR currency using Intl.NumberFormat.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project state file summarizing architecture notes, known issues, features, and versioning for a Meesho-like marketplace build."
}