{
  "backend/main.mo": "Main marketplace canister defining user profiles, products, categories, carts, and orders with authorization checks and admin‑gated product management APIs.",
  "backend/migration.mo": "Stub migration module exposing a no‑op run function.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and tests involved in admin bootstrap and auth refresh features.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files including pages, components, hooks, and configuration.",
  "frontend/index.css": "Tailwind base styles and custom CSS variables defining the warm color palette for light and dark themes.",
  "frontend/index.html": "Static HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React router configuration with theme provider and global toaster, defining all app routes including admin.",
  "frontend/src/components/admin/AdminProductManagementHelp.tsx": "Help card explaining how to use the admin product management interface.",
  "frontend/src/components/auth/AuthControls.tsx": "Auth control component handling sign‑in/out, account menu, and navigation to admin or become‑admin actions.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that blocks access to protected content and shows a sign‑in prompt when unauthenticated.",
  "frontend/src/components/cart/MobileCartShortcut.tsx": "Mobile‑only floating cart button showing item count and linking to the cart page.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the root layout with header, footer, routed content, profile setup dialog, and mobile cart shortcut.",
  "frontend/src/components/layout/Footer.tsx": "Renders a footer with the current year and a link attribution including app-specific tracking.",
  "frontend/src/components/layout/HeaderBar.tsx": "Displays the main navigation bar with logo, links, cart icon with count, and auth controls; shows admin link when applicable.",
  "frontend/src/components/marketplace/CategoryMenu.tsx": "Fetches and displays category buttons with loading and error states, allowing category selection.",
  "frontend/src/components/marketplace/ProductCard.tsx": "Shows a product preview card with image, price, mock discount, and link to the product page.",
  "frontend/src/components/marketplace/ProductGrid.tsx": "Renders a responsive grid of products with loading, empty, and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useCart.ts": "Provides cart items merged with product data plus subtotal, and mutation hooks for add, update, and remove.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns identity, profile, and admin status by querying the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, managing authentication, stored identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Contains data-fetching and mutation hooks for products, categories, orders, checkout, and user profile using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global border and background/foreground styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminSellerPage.tsx": "Provides an admin-only interface for managing products with add, edit, delete, and admin bootstrapping functionality.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the shopping cart, allowing quantity updates, item removal, and checkout handling.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a confirmation message for a placed order and provides navigation to orders or the storefront.",
  "frontend/src/pages/OrdersPage.tsx": "Lists a user's past orders with status badges, loading states, and authentication protection.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info with dynamic discount, quantity selection, and add‑to‑cart support.",
  "frontend/src/pages/StorefrontPage.tsx": "Shows the main storefront with product search, category filtering, hero section, and product grid.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash params, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins such as typography and container queries.",
  "project_state.json": "Describes the project’s current build plan, features, issues, and architectural notes for a Meesho‑like marketplace."
}