{
  "backend/main.mo": "Main actor implementing marketplace logic including products, categories, carts, orders, user profiles, and admin authorization with migration support.",
  "backend/migration.mo": "Migration module converting legacy orders to the new format by adding an address field while preserving other marketplace data.",
  "feature_evidence.json": "Feature evidence report mapping product features to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind styles defining color tokens, dark mode variables, and base UI styling.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Sets up the TanStack Router route tree and wraps the application in theme and toaster providers.",
  "frontend/src/components/admin/AdminProductManagementHelp.tsx": "UI help card explaining how admins can add products and listing required product fields.",
  "frontend/src/components/auth/AuthControls.tsx": "Provides sign-in/out controls and an account dropdown with profile and admin links based on authentication and role state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter and save their display name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and displays a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/cart/MobileCartShortcut.tsx": "Renders a floating mobile-only cart button showing the item count and linking to the cart.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the app’s main layout including header, footer, routed content, profile setup, and mobile cart shortcut.",
  "frontend/src/components/layout/Footer.tsx": "Displays footer info with dynamic year and a link attribution including a tracked app identifier.",
  "frontend/src/components/layout/HeaderBar.tsx": "Renders the top navigation bar with logo, navigation links, cart button, and auth controls.",
  "frontend/src/components/marketplace/CategoryMenu.tsx": "Displays a horizontal selectable list of product categories with loading and error states.",
  "frontend/src/components/marketplace/ProductCard.tsx": "Shows a clickable card for a product with image, category badge, title, and price.",
  "frontend/src/components/marketplace/ProductGrid.tsx": "Renders a responsive grid of product cards with skeletons, error handling, and empty-state messaging.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCart.ts": "Provides cart retrieval, item count, subtotal calculation, and mutations for adding, updating, and removing items.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches current user profile and role using identity and actor to determine admin status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, loading stored identities, and exposing auth status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for products, categories, orders, checkout, and profile operations via an actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminSellerPage.tsx": "Admin page for managing products and bootstrapping admin access with forms, dialogs, and CRUD actions.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity updates, removal, and checkout navigation requiring identity login.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles multi-step checkout including address entry, payment selection, and placing orders via mutation.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a placed order with navigation options.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's orders with loading, error, and empty states, using badges for status and formatted totals.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows product details with image, description, quantity controls, and add‑to‑cart logic including authentication checks.",
  "frontend/src/pages/ProfilePage.tsx": "Provides authenticated users a profile view with principal ID display, editable name field, and profile‑save actions.",
  "frontend/src/pages/StorefrontPage.tsx": "Renders the storefront with hero section, search, category filtering, and a product grid fed by query hooks.",
  "frontend/src/utils/currency.ts": "Formats numeric amounts into INR currency strings with no decimals.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for extracting, persisting, and clearing URL and session‑stored parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s state, including goals for a Meesho‑like marketplace, architectural notes, known issues related to admin access and checkout, and a list of implemented features. Serves as the central description of current capabilities and problems."
}