{
  "kind": "build_request",
  "title": "Add seller ability to accept or decline customer orders",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Extend the backend order lifecycle to support seller decisions by adding explicit order statuses for “accepted” and “declined”, and expose admin-only APIs to list all orders and to accept/decline an order.\n\nBackend changes must:\n- Update `OrderStatus` in `backend/main.mo` to include variants for accepted and declined.\n- Keep the existing `checkout(...)` behavior creating new orders with status `#pending`.\n- Add a query method that returns a list of all orders for admins only (seller/admin order inbox).\n- Add an admin-only update method that lets an admin change an order’s status from `pending` to either `accepted` or `declined`, with clear English error messages when the order does not exist, the caller is not an admin, or the transition is invalid.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "when a customer place  a order so there should be a option for the person who is seeling that he wants to accept or decline the order"
        ]
      },
      "acceptanceCriteria": [
        "Placing an order via the existing `checkout(...)` call creates an order with status `pending`.",
        "A non-admin caller cannot list all orders and cannot accept/decline any order; calls fail with clear English errors.",
        "An admin can list all orders and see newly placed orders in the results.",
        "An admin can set a pending order to accepted or declined; invalid order IDs and invalid transitions return clear English errors.",
        "Existing buyer-facing `getOrders()` continues to work and includes the updated status values for that buyer’s orders."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Add React Query hooks for seller/admin order management that integrate with the new backend APIs.\n\nFrontend changes must:\n- Add a query hook to fetch all orders for the current authenticated admin.\n- Add mutation hook(s) to accept an order and to decline an order (or a single mutation that updates status).\n- Ensure relevant caches are refreshed after mutations (e.g., invalidate/refetch both the admin orders list and the buyer orders query key `['orders']` when applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "there should be a option for the person who is seeling that he wants to accept or decline the order"
        ]
      },
      "acceptanceCriteria": [
        "When an order is accepted/declined from the UI, the admin order list refreshes and shows the updated status without a manual page refresh.",
        "The buyer’s “My Orders” view reflects the new status after data refetch (e.g., navigating back to /orders or refreshing triggers the updated status)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Add a seller/admin order review UI that allows accepting or declining newly placed orders.\n\nFrontend changes must:\n- Add an “Order Management” section within the existing `/admin` experience (AdminSellerPage) that is visible only to admins.\n- Display a list of orders with key details: order ID, buyer principal (or a safe identifier), item count, total (INR formatting), delivery address summary if present, current status.\n- For orders in `pending` status, show “Accept” and “Decline” actions.\n- After an action completes, show clear English success/error feedback and disable/prevent duplicate submissions while the mutation is pending.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "option for the person who is seeling that he wants to accept or decline the order"
        ]
      },
      "acceptanceCriteria": [
        "An admin can navigate to /admin and find an Order Management section.",
        "Pending orders show Accept and Decline buttons; non-pending orders do not show these action buttons.",
        "Clicking Accept changes the order status to accepted and updates the UI.",
        "Clicking Decline changes the order status to declined and updates the UI.",
        "All user-facing text in this UI is in English."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Update buyer-facing order status display to handle the new accepted/declined statuses consistently.\n\nFrontend changes must:\n- Update `/orders` (OrdersPage) status badge styling/variants to include the new statuses.\n- Ensure the status label shown to the user is clear and consistent (e.g., “accepted”, “declined”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "accept or decline the order"
        ]
      },
      "acceptanceCriteria": [
        "OrdersPage renders accepted and declined statuses without crashing and with appropriate badge styling.",
        "A buyer can see when their order is accepted or declined in the “My Orders” list."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit any files under `frontend/src/components/ui` or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing multi-seller support or assigning orders to specific sellers beyond the existing admin model.",
    "Adding real payment capture/refunds, notifications, email/SMS, or real-time updates.",
    "Adding external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}