{
  "kind": "build_request",
  "title": "Simplified 3-step checkout (address → review → payment) and INR pricing",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add a simplified 3-step checkout flow starting from the Cart page: Step 1 collects a delivery address (full name, mobile number, pincode, address line 1, address line 2 (optional), landmark (optional), city, state) and requires the user to click “Save address” before continuing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-9"
        ],
        "quotes": [
          "AFTER WE ADD PRODUCT TO CART ASK ADDRESS FULL WITH NAME MOBILE NO. PIN CODE ADDRESS LINE-1 THEN 2 AND LANDMARK CITY STATE AND THEN ASK TO SAVE IT",
          "DO THE SAME THING IN SIMPLER FORM AND CAN TRANSFORM IT BY YOUR CHOICE"
        ]
      },
      "acceptanceCriteria": [
        "From /cart, the primary CTA leads into a checkout experience rather than immediately placing the order.",
        "The address form includes inputs for: full name, mobile number, pincode, address line 1, address line 2 (optional), landmark (optional), city, state.",
        "The user cannot proceed to the next step until the address is validated and saved.",
        "All user-facing text in the checkout flow is in English."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Implement an order review step (Step 2) that shows the saved delivery address and the current cart items with quantities and line totals, plus an order total, before the user proceeds to payment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-9"
        ],
        "quotes": [
          "THEN AFTER THAT PREVIEW ORDER SUMMARY WHERE ADRESS AND PRODUCT WITH PRICE CAN BE SEEEN",
          "DO THE SAME THING IN SIMPLER FORM AND CAN TRANSFORM IT BY YOUR CHOICE"
        ]
      },
      "acceptanceCriteria": [
        "The review step displays the full saved address in a readable, multi-line layout.",
        "The review step lists each cart item with product title, quantity, unit price, and line total.",
        "The review step shows an order total that matches the cart subtotal (shipping can remain FREE if currently used).",
        "A Back action allows returning to the address step without losing the saved address."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Implement a simple payment step (Step 3) with at least one selectable payment option (e.g., “Cash on Delivery” and/or “UPI (demo)”) and a final “Pay & Place Order” action that completes the order without integrating any real payment gateway.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-9"
        ],
        "quotes": [
          "AND THEN COMPLETE PAYMENT OPTION",
          "DO THE SAME THING IN SIMPLER FORM AND CAN TRANSFORM IT BY YOUR CHOICE"
        ]
      },
      "acceptanceCriteria": [
        "The payment step requires selecting a payment option before placing the order.",
        "Clicking “Pay & Place Order” creates the order and navigates to the existing order confirmation route (/order-confirmation/$orderId) on success.",
        "Backend stores the payment option chosen on the order record (so it can be shown later if needed).",
        "No external payment providers are used."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Extend the backend order model and checkout API to persist the delivery address with each order created from the new checkout flow.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ASK ADDRESS FULL WITH NAME MOBILE NO. PIN CODE ADDRESS LINE-1 THEN 2 AND LANDMARK CITY STATE"
        ]
      },
      "acceptanceCriteria": [
        "A structured delivery address type is added in the Motoko canister (including the fields requested by the user).",
        "The checkout flow uses a backend method that accepts the delivery address and returns a created orderId.",
        "The created order record persists the address data alongside items and totals.",
        "If the user has an empty cart, the backend checkout call returns a clear English error (or equivalent failure behavior) rather than creating an empty order."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Display all product, cart, and order totals in INR (Indian Rupees) across the storefront product cards, product details page, cart page, checkout flow, and orders list; remove “$” formatting in these places.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "PRICE OF PRODUCT SHOULD BE IN INR RUPPESS INDIA"
        ]
      },
      "acceptanceCriteria": [
        "ProductCard price display uses INR formatting (e.g., ₹1,999) instead of “$xx.xx”.",
        "ProductDetailsPage price and strike-through price use INR formatting.",
        "CartPage item prices and order summary totals use INR formatting.",
        "OrdersPage order total uses INR formatting.",
        "No “$” currency symbol remains in these user-facing price locations."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add routing and navigation needed for the simplified checkout flow (new checkout route(s)), keeping the existing cart and order confirmation routes working.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "DO THE SAME THING IN SIMPLER FORM AND CAN TRANSFORM IT BY YOUR CHOICE"
        ]
      },
      "acceptanceCriteria": [
        "A new checkout route (or routes) is added to the TanStack Router configuration (frontend/src/App.tsx).",
        "The existing /cart route still renders the cart page and provides a clear path into checkout.",
        "The existing /order-confirmation/$orderId route continues to work without regressions.",
        "Checkout requires sign-in (consistent with the current behavior of requiring sign-in before placing an order)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Integrating a real payment gateway or processing real payments.",
    "Adding shipping rate calculation, tax calculation, or coupons/discount codes beyond the existing mock discount visuals.",
    "Implementing real-time order tracking or notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}