{
  "kind": "build_request",
  "title": "Add admin-only stock management and enforce inventory limits in cart/checkout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Extend the backend product model to support stock/inventory tracking per product, including storing an available stock quantity and exposing it in product reads.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i want to manage stock as well make a seperate stockoption only for admin so i can add no. of the product in stock"
        ]
      },
      "acceptanceCriteria": [
        "Each Product has a persisted stock quantity value (integer) that represents available units.",
        "Existing product read APIs (e.g., getProduct, getAllProductsSortedById, getProductsByCategory*) return the stock quantity so the frontend can display/enforce limits.",
        "Stock quantity cannot be negative; backend rejects invalid values with a clear English error message."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add admin-only backend APIs to manage inventory per product (set/update stock quantity) with clear authorization and error handling.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make a seperate stockoption only for admin so i can add no. of the product in stock"
        ]
      },
      "acceptanceCriteria": [
        "Only admins can update stock; non-admin callers receive a clear English unauthorized error.",
        "Updating stock for a non-existent product returns a clear English error.",
        "Updating stock succeeds and subsequent product fetches reflect the new stock quantity."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Enforce stock limits in the backend when customers add items to cart, update cart quantities, and place orders: prevent quantities from exceeding available stock and return a clear English message indicating the current in-stock quantity.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "if the quanity is exceeded by customer then it should show we have this much in stock at this moment"
        ]
      },
      "acceptanceCriteria": [
        "If a user attempts to set cart quantity above available stock, the backend rejects the request with a clear English error message that includes the available quantity (e.g., \"We have only X in stock at this moment.\").",
        "Checkout validates that all cart item quantities are <= available stock at the moment of checkout; if not, checkout fails with a clear English error message that includes the available quantity (and identifies the relevant product).",
        "On successful checkout, the backend reduces stock quantities for all purchased items accordingly (stock decremented by ordered quantity).",
        "Stock cannot go below zero after checkout; the backend prevents this with validation."
      ]
    },
    {
      "id": "REQ-36",
      "text": "If the project uses persisted/stable state for products across upgrades, add conditional migration support so existing products receive a sensible default stock quantity without breaking deployed canisters.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i want to manage stock as well"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading an existing canister does not trap due to missing stock fields.",
        "Existing products after upgrade have a deterministic default stock quantity (documented in code), and admins can adjust it via the new stock APIs."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Add React Query hooks for admin inventory management (fetch stock-aware products and update stock quantity), and ensure relevant caches are invalidated/refetched after stock updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make a seperate stockoption only for admin"
        ]
      },
      "acceptanceCriteria": [
        "A mutation hook exists to update a product’s stock quantity via the new backend admin API.",
        "After a successful stock update, product-related queries are invalidated/refetched so the UI updates immediately (e.g., ['products'], ['product', id]).",
        "Errors from stock enforcement or authorization are shown to the admin as clear English messages."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Add an admin-only \"Stock\" option/section within the existing /admin experience (AdminSellerPage) to view and update stock quantities per product.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make a seperate stockoption only for admin so i can add no. of the product in stock"
        ]
      },
      "acceptanceCriteria": [
        "The Stock section is visible only when the current user is an admin (consistent with existing admin gating).",
        "The Stock section lists products with at least: product title, product id, and current stock quantity.",
        "Admins can set/update stock quantity for a product from this section (e.g., inline input + save button), with controls disabled during pending mutations.",
        "After save, the UI shows clear English success/error feedback and reflects the updated stock quantity."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Enforce and communicate stock limits in customer-facing UI flows (Product Details, Cart, and Checkout): when the user attempts to exceed available stock, show a clear English message indicating the current in-stock quantity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "if the quanity is exceeded by customer then it should show we have this much in stock at this moment"
        ]
      },
      "acceptanceCriteria": [
        "On ProductDetailsPage, attempting to add a quantity that exceeds available stock results in a clear error toast/message that includes the available quantity (e.g., \"We have only X in stock at this moment.\").",
        "On CartPage, attempting to increment quantity beyond available stock results in a clear error toast/message with the available quantity, and the UI does not end up showing a cart quantity greater than the stock.",
        "On CheckoutPage, if checkout fails due to stock limits, the error is displayed in clear English and includes the available quantity (and the relevant product), and the order is not placed."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not edit frontend files in immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose existing UI components instead).",
    "All user-facing text introduced/modified for this change must be in English."
  ],
  "nonGoals": [
    "Implementing warehouse locations, multiple stock sources, or product variants (size/color) inventory.",
    "Implementing stock reservations/holds or real-time inventory synchronization beyond request-time validation.",
    "Adding external database or third-party inventory integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}