{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Seller/admin order accept/decline UI and hooks",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Add React Query hooks for admin order listing and accept/decline actions with cache refresh.",
      "acceptanceCriteria": [
        "When an order is accepted/declined from the UI, the admin order list refreshes and shows the updated status without a manual page refresh.",
        "The buyer’s “My Orders” view reflects the new status after data refetch (e.g., navigating back to /orders or refreshing triggers the updated status)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add seller/admin order management hooks: a query hook to fetch all orders (use a dedicated query key like ['adminOrders']) and mutation hook(s) that call the backend function to update an order status to accepted/declined. Ensure onSuccess invalidates/refetches both the admin orders query and the buyer orders query key ['orders'] when applicable. Use the authorization component’s role-based access control indirectly (admin-only backend checks + UI gating elsewhere); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add an admin-only Order Management section in /admin to review pending orders and accept/decline them with feedback and submission locking.",
      "acceptanceCriteria": [
        "An admin can navigate to /admin and find an Order Management section.",
        "Pending orders show Accept and Decline buttons; non-pending orders do not show these action buttons.",
        "Clicking Accept changes the order status to accepted and updates the UI.",
        "Clicking Decline changes the order status to declined and updates the UI.",
        "All user-facing text in this UI is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSellerPage.tsx",
          "operation": "modify",
          "description": "Within the existing admin experience, add an \"Order Management\" section that is only rendered for admins. Use the new hooks to load all orders and render a table/list with: order ID, a safe buyer identifier (avoid full principal; use a truncated principal string or profile name if already available), item count, total formatted via formatINR, delivery address summary (first line) when present, and current status. For pending orders only, render Accept and Decline actions wired to the mutation hooks; disable buttons while a mutation is pending to prevent duplicate submissions; show clear English success/error feedback (e.g., using existing toast flow). Use the authorization component (role-based access control) via existing admin gating in this page (useCurrentUser/isAdmin) to ensure visibility is admin-only; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCurrentUser.ts",
          "operation": "modify",
          "description": "If needed for a smoother admin-only experience, extend current user state to expose any additional admin-check status (e.g., explicit loading/error) used to guard the new Order Management section. Continue using the authorization component’s role-based access control through isCallerAdmin; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update buyer order status badge styling and labels to support accepted/declined consistently.",
      "acceptanceCriteria": [
        "OrdersPage renders accepted and declined statuses without crashing and with appropriate badge styling.",
        "A buyer can see when their order is accepted or declined in the “My Orders” list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OrdersPage.tsx",
          "operation": "modify",
          "description": "Update status badge variant mapping to include the new statuses: accepted and declined. Ensure the displayed label remains clear and consistent (e.g., 'accepted', 'declined') and that any other existing statuses still render safely with a default variant."
        }
      ]
    }
  ]
}